/* No comment provided by engineer. */
" and %@" = " ja %@";

/* update notice when someone comments. %1$@ is the commenter name, %2$@ is the comment. */
"%1$@ commented: %2$@" = "%1$@ kommentoi: %2$@";

/* update notice when someone suggests an ID. %1$@ is the username, %2$@ is the species. */
"%1$@ suggested an ID: %2$@" = "%1$@ ehdotti tunnistetta: %2$@";

/* confirmation alert text when changing a users network affiliation. %1%@ is network name, %2%@ is the country, %3%@ is the network name again */
"%@ is a member of the iNaturalist Network in %@. Local institutions supporting %@ will have access to your email address and access to the true coordinates for observations that are publicly obscured or private. Would you like to change your affiliation?" = "%1$@ on kansainvälisen iNaturalist-verkoston jäsen maassa %2$@. Suomessa paikallisesta toiminnasta vastaa Suomen Lajitietokeskus. Haluatko yhdistää tunnuksesi tähän (suositeltu)? Tällöin paikallinen organisaatio näkee havaintojesi tarkat paikat sekä sähköpostiosoitteesi, joten havaintosi tulevat paremmin hyötykäyttöön, ja voit saada paikallisia %3$@iin liittyviä tiedotteita.	";

/* join iNat network partner alert message - %1%@ is the country name, %2%@ is partner name */
"%@ is part of the international iNaturalist Network. Would you like to join %@ to localize your experience of iNaturalist and share data with local institutions?" = "%1$@ on jäsen kansainvälisessä iNaturalist-verkostossa. Haluatko liittyä %2$@: iin tehdäksesi iNaturalistin käytöstä paikallisempaa ja jakaaksesi tallentamasi sisällön paikallisten instituutioiden kanssa?";

/* site news */
"%@ News" = "%@ uutiset";

/* identification author attribution */
"%@'s ID" = "%@:n tunniste";

/* No comment provided by engineer. */
"%@, build %@" = "%1$@, build %2$@";

/* No comment provided by engineer. */
"%@, build %@, iOS %@" = "%1$@, build %2$@, iOS %3$@";

/* Count of observations by this user, singular. */
"%d Observation" = "%d havainto";

/* Count of observations to upload, singular. */
"%d Observation To Upload" = "%d havainto tallennettavana";

/* Count of observations by this user, plural. */
"%d Observations" = "%d havainnot";

/* Count of observations to upload, plural. */
"%d Observations To Upload" = "%d havaintoa tallennettavana";

/* No comment provided by engineer. */
"'%@' requires that you fill out the '%@' field." = "%1$@' vaatii että täytät '%2$@'-kentän.";

/* positional accuracy when we don't know */
"???" = "???";

/* About button title in Settings
   About project button
   about the project header
   title of about screen */
"About" = "Tietoja";

/* title for about section of the guide screen */
"ABOUT" = "TIETOJA";

/* about this project title */
"About this Project" = "Tietoja tästä projektista";

/* emphasis text for the 'switch to login mode' button. must be a substring of the base text */
"Account?" = "Tili?";

/* No comment provided by engineer. */
"Activity" = "Toiminta";

/* Title for add comment failed alert */
"Add Comment Failure" = "Kommentin lisäämshäiriö";

/* Title for add ID failed alert */
"Add Identification Failure" = "Tunnistuksen lisäämishäiriö";

/* No comment provided by engineer. */
"Add to Favorites" = "Lisää suosikkeihin";

/* Label for a button that adds an ID of the same taxon as the current one, so the sense is 'I agree with this identification' */
"Agree" = "Samaa mieltä";

/* base text for the 'switch to login mode' button */
"Already have an Account?" = "On jo tili?";

/* Title for app section of settings. */
"App Settings" = "Sovellusasetukset";

/* No comment provided by engineer. */
"Are you really sure?" = "Oletko aivan varma?";

/* No comment provided by engineer. */
"Are you sure you want to leave this project?" = "Haluatko varmasti jättää tämän projektin?";

/* No comment provided by engineer. */
"Are you sure?" = "Oletko varma?";

/* No comment provided by engineer. */
"Are you sure? This is permanent." = "Oletko varma? Tämä on pysyvää.";

/* argentina partner */
"Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org)." = "Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org).";

/* australia partner */
"Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/)." = "Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/).";

/* Auto state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Auto" = "Automaattinen";

/* label for autocomplete names switch in settings */
"Autocomplete names" = "Täytä nimet automaattisesti";

/* label for auto upload switch in settings */
"Automatic upload" = "Automaattinen tallennus";

/* Base text for terms of service and privacy policy notice when creating an iNat account. */
"By using iNaturalist you agree to the Terms of Service and Privacy Policy." = "Käyttämällä iNaturalistia, hyväksyt Käyttöehdot ja Tietosuojakäytännön.";

/* vision assistance */
"CalTech and Cornell Tech helped develop the computer vision system that suggests identifications from photographs. We thank Grant Van Horn, Serge Belongie, and Pietro Perona for advancing the computer vision research. More information can be found at visipedia.org. Special thanks to NVIDIA for additional assistance." = "CalTech ja Cornell Tech auttoivat kehittämään konenäköjärjestemän, joka ehdottaa tunnistuksia valokuvista. Kiitämme Grant Van Hornia, Serge Belongieta, ja Pietro Peronaa konenäkötutkimuksen edistämisestä. Lisää tietoa osoitteesta visipedia.org. Erityiskiitos NVIDIA:lle lisäavusta.";

/* accessibility label for camera shutter button */
"Camera Shutter" = "Kameran suljin";

/* No comment provided by engineer. */
"Can't Add ID" = "Ei voi lisätä tunnistetta";

/* No comment provided by engineer. */
"Can't Comment" = "Ei voi kommentoida";

/* No comment provided by engineer. */
"Can't Fave" = "Ei voi merkitä suosikiksi";

/* Error message for when we can't retrieve your observations on Explore */
"Can't search for your observations right now. Please try later." = "Havaintojen haku ei onnistunut juuri nyt. Ole hyvä ja yritä uudelleen myöhemmin.";

/* canada partner */
"Canada: Canadian Wildlife Federation, the Royal Ontario Museum, NatureServe Canada, and Parks Canada operating iNaturalist Canada (inaturalist.ca)." = "Kanada: Canadian Wildlife Federation, Royal Ontario Museum, NatureServe Canada ja Parks Canada ylläpitävät portaalia iNaturalist Canada (inaturalist.ca).";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Title of me header while cancellling an upload session. */
"Cancelling..." = "Peruutetaan...";

/* Alert message for invalid date */
"Cannot choose a date in the future." = "Et voi valita päivää, joka on tulevaisuudessa.";

/* Failure message */
"Cannot donate" = "Ei voida lahjoittaa";

/* error when loading suggestions. %@ is the error message */
"Cannot load suggestions: %@" = "Ei voida ladata ehdotuksia: %@";

/* Store launch failure message */
"Cannot open store" = "Kaupan avaaminen epäonnistui";

/* Failure message */
"Cannot rate" = "Ei voida arvostella";

/* No comment provided by engineer. */
"Cannot search iNaturalist.org" = "iNaturalistista ei voida hakea";

/* Title of alert when the system is not configured for the user to send email */
"Cannot Send Email" = "Sähköpostin lähetys ei onnistu";

/* No comment provided by engineer. */
"Cannot use your location" = "Ei voida käyttää sijaintiasi";

/* Captive / cultivated button title. */
"Captive / Cultivated" = "Vankeudessa / viljelty";

/* message explaining what captive / cultivated means for iNaturalist */
"Captive / cultivated means that the organism exists where it was observed because humans intended it to be there. iNaturalist is about observing wild organisms, and our scientific data partners are not interested in observations of pets, gardens, or animals in zoos." = "Vangittu / viljelty tarkoittaa että eliö esiintyy havaintopaikassa koska ihmiset halusivat sen olevan siellä. iNaturalistin tarkoituksena on havainnoida villejä eliöitä, ja tieteelliset kumppanimme eivät toivo havaintoja lemmikeistä, puutarhoista tai eläintarha-eläimistä.";

/* title for captive selector */
"Captive?" = "Vangittu?";

/* casual data quality */
"Casual Grade" = "Rentoaste";

/* label for change email address action in settings */
"Change email" = "Vaihda sähköposti";

/* No comment provided by engineer. */
"Change Email" = "Vaihda sähköposti";

/* No comment provided by engineer. */
"Change email address?" = "Vaihda sähköpostiosoite?";

/* accessibility label for change flash button */
"Change Flash" = "Vaihda salama";

/* accessibility label for flash button when mode is auto */
"Change Flash Toggle. Current state is Auto" = "Muuta salaman valinta. Nyt automaattinen";

/* accessibility label for flash button when mode is off */
"Change Flash Toggle. Current state is Off" = "Muuta salaman valinta. Nyt poissa päältä";

/* accessibility label for flash button when mode is on */
"Change Flash Toggle. Current state is On" = "Muuta salaman valinta. Nyt päällä";

/* label for change username action in settings */
"Change username" = "Vaihda käyttäjänimi";

/* No comment provided by engineer. */
"Change Username" = "Vaihda käyttäjänimi";

/* No comment provided by engineer. */
"Change username?" = "Vaihda käyttäjänimi?";

/* No comment provided by engineer. */
"Change your profile photo?" = "Vaihda profiilikuvasi?";

/* Alert text for the license content checkbox during create account. */
"Check this box if you want to apply a Creative Commons Attribution-NonCommercial license to your photos. You can choose a different license or remove the license later, but this is the best license for sharing with researchers." = "Laita tähän ruksi jos haluat liittää Creative Commons Nimeä-Epäkaupallinen -lisenssin havaintoihisi. Voit valita erilaisen lisenssin tai poistaa lisenssin myöhemmin, mutta tämä on paras lisenssi jos haluat jakaa havaintosi tutkijoiden käyttöön.";

/* title of alert after you reset your password */
"Check your email" = "Tarkista sähköpostisi";

/* chile partner */
"Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl)." = "Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl).";

/* No comment provided by engineer. */
"Choose from library" = "Valitse kirjastosta";

/* title of inat network picker */
"Choose iNat Network" = "Valitse iNat-verkko";

/* title for project observations chooser */
"Choose Projects" = "Valitse projektit";

/* accessibility label for close camera button */
"Close Camera" = "Sulje kamera";

/* Collection type of project, which automatically collects observations into it. */
"Collection Project" = "Kokoelmaprojekti";

/* colombia partner */
"Colombia: Instituto Humboldt operating Naturalista (colombia.inaturalist.org)." = "Kolumbia: Instituto Humboldt ylläpitävät portaalia Naturalista (colombia.inaturalist.org).\n";

/* No comment provided by engineer. */
"Comment" = "Kommentti";

/* label for contact support action in settings. */
"Contact support" = "Ota yhteys tukeen";

/* Title for About Content Licensing notice during signup */
"Content Licensing" = "Sisällön lisensointi";

/* Button to copy the scientific name */
"Copy Scientific Name" = "Kopioi tieteellinen nimi";

/* Title of an alert dialog you see when you try to agree with an identification but cannot due to connection issues or other errors */
"Couldn't Agree" = "Epäonnistui";

/* Project validation error. first string is project title, second is the specific error */
"Couldn't be added to project %@. %@" = "Ei voitu lisätä projektiin %1$@. %2$@";

/* No comment provided by engineer. */
"Couldn't determine your location" = "Sijaintiasi ei voitu määrittää";

/* intro to credits section. */
"Credits" = "Tekijät";

/* Header for data quality section of obs detail */
"Data Quality" = "Tietojen laatu";

/* No comment provided by engineer. */
"Default" = "Oletus";

/* button to  delete a locally downloaded species guide. */
"Delete download" = "Poista lataus";

/* No comment provided by engineer. */
"Delete Error" = "Poistovirhe";

/* text of delete obs button */
"Delete Observation" = "Poista havainto";

/* Deletes pending sync. */
"Deletes To Sync" = "Synkronoitavat poistot";

/* title for description section of the guide screen */
"DESCRIPTION" = "KUVAUS";

/* Title for confirm new observation details view */
"Details" = "Tiedot";

/* Button to cancel showing tutorial screens when visiting new tabs */
"Don't Show Me Hints" = "Älä näytä minulle vihjeitä";

/* No comment provided by engineer. */
"Download" = "Lataa";

/* title for button that allows a user to download a species guide and use it while offline. */
"Download for offline use" = "Lataa offline-käyttöön";

/* No comment provided by engineer. */
"Download not available" = "Lataus ei ole käytettävissä";

/* notice that a species guide has been downloaded from the server and can be used while offline. */
"Downloaded" = "Ladattu";

/* Notice when we're downloading a species guide from the server, to be used offline */
"Downloading..." = "Ladataan...";

/* ecuador partner */
"Ecuador: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org)." = "Ecuador: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org).";

/* The editor or author of the species guide */
"Editor" = "Muokkain";

/* message for the alert when a guide download fails, if we can't extract an error message. */
"Either there was an error on the server or the guide no longer exists." = "Virhe palvelimella tai opasta ei enää ole olemassa.";

/* label for email field in settings */
"Email" = "Sähköposti";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* failure title when changing a setting. */
"Error changing setting." = "Error changing setting.";

/* No comment provided by engineer. */
"Error Fetching Observations" = "Virhe havaintoja haettaessa";

/* error loading leaderboard title */
"Error loading leaderboard" = "Virhe tulostaulukkoa ladatessa";

/* No comment provided by engineer. */
"Explore" = "Tutki";

/* title of alert when a guide download fails. a localized error message provided by iOS or the server follows. */
"Failed to download guide" = "Virhe ladattaessa opasta";

/* Unknown iNat login error */
"Failed to login to iNaturalist. Please try again." = "Virhe kirjautuessa iNaturalistiin. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Failed to save guide" = "Oppaan tallentaminen epäonnistui";

/* No comment provided by engineer. */
"Faved" = "Merkitty suosikiksi";

/* No comment provided by engineer. */
"Featured" = "Suositellut";

/* This is an explanation for when auth token fetch fails during upload/sync. */
"Fetching an authentication token failed. Please contact help@inaturalist.org and try later." = "Autentikointi-tokenin haku epäonnistui. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Fetching recent observations in map area" = "Haetaan tuoreita havaintoja kartan alueelta";

/* No comment provided by engineer. */
"Fetching recent observations worldwide" = "Haetaan tuoreita havaintoja maailmanlaajuisesti";

/* No comment provided by engineer. */
"Find %@ named '" = "Etsi %@ nimeltä '";

/* No comment provided by engineer. */
"Find my observations" = "Hae havaintoni";

/* No comment provided by engineer. */
"Find observations near me" = "Hae havaintoja läheltä minua";

/* No comment provided by engineer. */
"Finding your location..." = "Haetaan sijaintiasi...";

/* finland partner */
"Finland: Finnish Museum of Naturalist History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi)." = "Finland: Finnish Museum of Naturalist History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi).";

/* Title for forgot password button. */
"Forgot password?" = "Unohditko salasanan?";

/* Geoprivacy button title */
"Geoprivacy" = "Sijainnin tietosuoja";

/* No comment provided by engineer. */
"Go Back" = "Mene takaisin";

/* Button to dismiss a tutorial screen */
"Got It" = "Selvä";

/* No comment provided by engineer. */
"Guide download error" = "Virhe oppaan lataamisessa";

/* No comment provided by engineer. */
"Guide editor must enable this feature." = "Oppaan muokkaajan on otettava tämä ominaisuus käyttöön.";

/* No comment provided by engineer. */
"Guides" = "Oppaat";

/* Subtitle above image for guides tutorial screen */
"Guides are created and shared by the iNaturalist community" = "Oppaat ovat iNaturalist-yhteisön tekemiä ja jakamia";

/* Title for guides tutorial screen */
"Guides are lists of species" = "Oppaat ovat listoja lajeista";

/* Title for help section of settings. */
"Help" = "Ohje";

/* No comment provided by engineer. */
"Here are our top ten species suggestions:" = "Tässä meidän 10 parasta lajiehdotustamme:";

/* Title of identification failure alert */
"Identification Failed" = "Tunnistaminen epäonnistui";

/* Title for taxon section when adding an ID */
"Identification Taxon" = "Taksonin tunnistus";

/* No comment provided by engineer. */
"Identifications" = "Tunnistamiset";

/* No comment provided by engineer. */
"Identifiers" = "Tunnisteet";

/* body of alert after you reset your password */
"If the email address you entered is associated with an iNaturalist account, you should receive an email at that address with a link to reset your password." = "Jos antamasi sähköpostiosoite on liitetty iNaturalist-tunnukseen, saat pian sähköpostiviestin, jossa on linkki salasanan uusimiseksi.";

/* No comment provided by engineer. */
"in project '%@'" = "projektissa '%@'";

/* inat core team, alphabetically */
"iNaturalist exists thanks to every single person who participates in our community. The people who build the software, design the interfaces, maintain our infrastructure, support the community, and foster collaborations are Yaron Budowski, Amanda Bullington, Tony Iwane, Patrick Leary, Scott Loarie, Abhas Misraraj, Carrie Seltzer, Alex Shepard, and Ken-ichi Ueda." = "iNaturalist on olemassa kaikkien sen yhteisöön osallistuvien ansiosta. Ohjelmistoa suunnittelee, kehittää ja ylläpitää sekä yhteisöä tukevat Yaron Budowski, Amanda Bullington, Tony Iwane, Patrick Leary, Scott Loarie, Abhas Misraraj, Carrie Seltzer, Alex Shepard, ja Ken-ichi Ueda.";

/* inat joint initiative statement */
"iNaturalist is a joint initiative of the California Academy of Sciences and the National Geographic Society" = "iNaturalist on Kalifornian tiedeakatemian ja National Geographic Societyn yhteinen aloite";

/* label for inaturalist network action in settings */
"iNaturalist Network" = "iNaturalist -verkosto";

/* open source contributions */
"iNaturalist uses Glyphish icons by Joseph Wain, ionicons by Ben Sperry, and icons by Luis Prado and Roman Shlyakov from the Noun Project. iNaturalist is also deeply grateful to the Cocoapods community, and to the contributions of our own open source community. See https://github.com/inaturalist/INaturalistIOS." = "iNaturalist käyttää Joseph Wainin Glyphish-ikoneita, Ben Sperryn ionicons-ikoneita sekä Noun Project:in Luis Pradon and Roman Shlyakovin ikoneita. iNaturalist on myös kiitollinen Cocoapods-yhteisölle sekä avoimen lähdekoodin yhteisömme avulle. Katso https://github.com/inaturalist/INaturalistIOS.";

/* Error msg when we get a 401 from the server */
"Incorrect username or password." = "Virheellinen käyttäjänimi tai salasana.";

/* No comment provided by engineer. */
"Internet connection required" = "Internet-yhteys vaaditaan";

/* No comment provided by engineer. */
"Internet required" = "Edellytetään Internetiä";

/* title of autoupload introduction alert view */
"Introducing Auto Upload!" = "Esittelyssä automaattitallennus!";

/* Invalid date alert title */
"Invalid Date" = "Virheellinen päivämäärä";

/* Error for bad email when making account. */
"Invalid Email Address" = "Virheellinen sähköpostiosoite";

/* Unknown invalid input */
"Invalid input" = "Virheellinen syöte";

/* No comment provided by engineer. */
"Invalid Location" = "Virheellinen sijainti";

/* Error for bad username hwne making account.
   Error for bad username when making account. */
"Invalid Username" = "Virheellinen käyttäjänimi";

/* israel partner */
"Israel: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org)." = "Israel: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org).";

/* iucn places credit */
"IUCN category II places provided by IUCN and UNEP-WCMC (2015), The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Available at: www.protectedplanet.net." = "IUCN:n kategorian II paikat perustuen IUCN:n ja UNEP-WCMC:n (2015) tietoihin, tietokantaan The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Saatavissa: www.protectedplanet.net.";

/* Join project button */
"Join" = "Liity";

/* join iNat network partner alert title */
"Join %@?" = "Liity %@iin?";

/* Subtitle above image for projects tutorial screen */
"Join projects to select them when you record observations" = "Liity projekteihin, niin voit liittää havaintosi niihin.";

/* No comment provided by engineer. */
"Joined" = "Liittynyt";

/* No comment provided by engineer. */
"Joining..." = "Liitytään...";

/* visualization of latitude/longitude/accuracy */
"Lat: %.5f Long: %.5f Acc: %@" = "Leveys: %1$.5f Pituus: %2$.5f Tarkkuus: %3$@";

/* Title for leaderboard page. */
"Leaderboard" = "Tulostaulukko";

/* Emphasis text for the license my content checkbox. Must be a substring of the base string. */
"Learn More" = "Lisätietoja";

/* learn more (about network partner changes) button text */
"Learn more" = "Lue lisää";

/* No comment provided by engineer. */
"Learn more about data quality >" = "Lisätietoja tietojen laadusta >";

/* Leave project button */
"Leave" = "Poistu";

/* No comment provided by engineer. */
"Leaving..." = "Poistutaan...";

/* The license of the species guide */
"License" = "Lisenssi";

/* No comment provided by engineer. */
"Loading..." = "Ladataan...";

/* No comment provided by engineer. */
"Location Fetch Error" = "Virhe paikan hakemisessa";

/* No comment provided by engineer. */
"Location Services Denied" = "Sijaintipalvelut kielletty";

/* No comment provided by engineer. */
"Location Services Restricted" = "Paikannuspalvelut rajoitettu";

/* No comment provided by engineer. */
"locations" = "sijainnit";

/* Title for button that allows users to log in to their existing iNat account */
"Log In" = "Kirjaudu sisään";

/* No comment provided by engineer. */
"Log In / Sign Up" = "Kirjaudu sisään / rekisteröidy";

/* No comment provided by engineer. */
"Login and upload this observation to enable comments & identifications." = "Kirjausu sisään ja lähetä tämä havainto, jotta siihen voisi liittää kommentteja ja tunnistuksia.";

/* No comment provided by engineer. */
"Login to enable faves." = "Kirjaudu ottaaksesi suositukset käyttöön.";

/* placeholder text for taxon search bar */
"Look up a species by name" = "Etsi lajia nimellä";

/* unknown taxon subtitle when suggestions are unavailable */
"Look up species name" = "Etsi lajinimeä";

/* No comment provided by engineer. */
"Looks like there was an error: %@" = "Virhe: %@";

/* Notice to display to the user on the Me tab when they have no observations */
"Looks like you have no observations." = "Näyttää siltä että sinulla ei ole havaintoja.";

/* label for app store rating action in settings. */
"Love iNat? Rate us" = "Pidätkö kovasti iNatista? Arvostele meidät";

/* No comment provided by engineer. */
"Make sure iNat has permission to access your location or give the GPS some time to fetch it." = "Varmista että iNauralistilla on oikeus käyttää sijaintiasi ja anna GPS: lle aikaa paikantaa sinut.";

/* title for action sheet allowing user to delete a locally downloaded guide. */
"Manage download" = "Hallitse latauksia";

/* No comment provided by engineer. */
"Map of Observations" = "Havaintojen kartta";

/* Placeholder text for not logged title on me tab. */
"Me" = "Minä";

/* mexico partner */
"Mexico: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) operating NaturaLista (NaturaLista.mx)." = "Meksiko: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) ylläpitää portaalia NaturaLista (NaturaLista.mx).";

/* Title for alert when db migration fails. */
"Migration Failed" = "Siirto epäonnistui";

/* Title for alert when db migration had a problem. */
"Migration Problem" = "Ongelma siirrossa";

/* No comment provided by engineer. */
"Missing Date" = "Puuttuva päivämäärä";

/* No comment provided by engineer. */
"Missing Location" = "Puuttuva sijainti";

/* No comment provided by engineer. */
"Missing Required Field" = "Puuttuva pakollinen kenttä";

/* No comment provided by engineer. */
"My Content" = "Sisältöni";

/* No comment provided by engineer. */
"named '%@ (%@)'" = "nimetty '%1$@ (%2$@)'";

/* No comment provided by engineer. */
"named '%@'" = "nimetty %@";

/* No comment provided by engineer. */
"Nearby" = "Lähellä";

/* needs id data quality */
"Needs ID" = "Tarvitsee tunnisteen";

/* subtitle for an observation that failed validation. */
"Needs Your Attention" = "Tarvitsee huomiotasi";

/* Network (i.e. an Internet connection) is required error message */
"Network is required." = "Edellytetään verkkoa.";

/* No comment provided by engineer. */
"Network unavailable" = "Verkko ei ole käytettävissä";

/* No comment provided by engineer. */
"Network Unavailable" = "Verkko ei ole käytettävissä";

/* No comment provided by engineer. */
"Never mind" = "Unohda koko juttu";

/* base text for the 'switch to signup mode' button */
"New to iNaturalist? Sign up now!" = "Uusi iNaturalistiin? Rekisteröidy nyt!";

/* nz partner */
"New Zealand: New Zealand Biodiversity Recording Network operating iNaturalist NZ — Mātaki Taiao (inaturalist.nz)." = "Uusi-Seelanti: New Zealand Biodiversity Recording Network ylläpitää portaalia iNaturalist NZ — Mātaki Taiao (inaturalist.nz).";

/* News project button */
"News" = "Uutiset";

/* Confirm a new photo */
"NEXT" = "SEURAAVA";

/* Generic negative response to a yes/no question
   negative response to binary choice, yes or no */
"No" = "Ei";

/* No comment provided by engineer. */
"No description" = "Ei kuvausta";

/* No comment provided by engineer. */
"No iNaturalist Results" = "Ei iNaturalist-tuloksia";

/* place guess when we have no location information */
"No location" = "Ei sijaintia";

/* No comment provided by engineer. */
"No matching taxa" = "Ei täsmääviä taksoneita";

/* No comment provided by engineer. */
"No network connection." = "Ei verkkoyhteyttä.";

/* No comment provided by engineer. */
"No network connection. :(" = "Ei verkkoyhteyttä. :(";

/* Header observation count title when there are none. */
"No Observations" = "Ei havaintoja";

/* Error notice when exploring observations, when no obserations were found within a map area. */
"No observations found in map area." = "Kartan alueelta ei löytynyt havaintoja.";

/* Error notice when exploring observations when no observations were found. */
"No observations found." = "Havaintoja ei löytynyt.";

/* No comment provided by engineer. */
"No observations yet." = "Ei havaintoja vielä.";

/* accessibility label for no photo button */
"No Photo" = "Ei kuvaa";

/* No comment provided by engineer. */
"No Photos and Missing Identification" = "Valokuva ja tunnistus puuttuu";

/* No comment provided by engineer. */
"No such organisms found. :(" = "Eliötä ei löydy. :(";

/* No comment provided by engineer. */
"No such person found. :(" = "Henkilöä ei löydy. :(";

/* No comment provided by engineer. */
"No such place found. :(" = "Mitään tällaista paikkaa ei löytynyt. :(";

/* No comment provided by engineer. */
"No such project found. :(" = "Mitään tällaista projektia ei löytynyt. :(";

/* No comment provided by engineer. */
"No Thanks" = "Ei kiitos";

/* No comment provided by engineer. */
"No updates yet. Stay tuned!" = "Ei päivityksiä vielä. Pysy kanavalla!";

/* No comment provided by engineer. */
"No URL configured" = "URL-osoitetta ei ole määritetty";

/* do not change network partner button */
"No, don’t change my affiliation" = "Ei, älä vaihda verkostoa johon tunnuksesi on liitetty";

/* Title for no photo button in the camera when making a new observation. Can support two very short lines of text. */
"NO\nPHOTO" = "EI\nKUVAA";

/* No comment provided by engineer. */
"None, all rights reserved" = "Ei mitään, kaikki oikeudet pidätetään";

/* No comment provided by engineer. */
"Not Allowed" = "Ei sallittu";

/* 403 unauthorized title */
"Not Authorized" = "Ei varmennettu";

/* Placeholder for observation notes when making a new observation. */
"Notes..." = "Lisätietoja...";

/* Observation option for explore leaderboard sorting. Must be short. */
"Obs" = "Hav";

/* obscured geoprivacy */
"Obscured" = "Piilotettu";

/* Project validation error, with the specific error */
"Observation Field Validation error: %@" = "Havaintokentän validointivirhe: %@";

/* No comment provided by engineer. */
"Observations" = "Havainnot";

/* No comment provided by engineer. */
"Observers" = "Havainnoijat";

/* Off state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Off" = "Pois";

/* No comment provided by engineer. */
"OK" = "OK";

/* On state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"On" = "Päällä";

/* Title error with oops text. */
"Oops" = "Hups";

/* open geoprivacy */
"Open" = "Avoin";

/* No comment provided by engineer. */
"Open link in Safari" = "Avaa linkki Safarissa";

/* No comment provided by engineer. */
"organisms" = "eliöt";

/* panama partner */
"Panama: Ministerio de Ambiente operating iNaturalistPa (panama.inaturalist.org)." = "Panama: Ministerio de Ambiente ylläpitää portaalia iNaturalistPa (panama.inaturalist.org).";

/* Error for bad password when making account */
"Passwords must be at least six characters in length." = "Salasanassa täytyy olla vähintään kuusi merkkiä.";

/* No comment provided by engineer. */
"people" = "ihmiset";

/* No comment provided by engineer. */
"Permission denied" = "Lupa evätty";

/* Title for photo load error alert msg */
"Photo Load Error" = "Photo Load Error";

/* Title for photo save error alert msg */
"Photo Save Error" = "Kuvan tallennusvirhe";

/* Title for photos error alert msg */
"Photos Error" = "Photos Error";

/* accessibility label for pick from library button */
"Pick from Library" = "Poimi kirjastosta";

/* No comment provided by engineer. */
"Placeholder" = "Paikkamerkki";

/* helpful note about observations and collection projects on the screen where you can add observations to projects. */
"Please note: Observations will be automatically included in a collection project if they meet its requirements." = "Huom: Havainnot lisätään automaattisesti koontiprojektiin, jos ne täyttävät sen vaatimukset.";

/* No comment provided by engineer. */
"Please pick a valid location." = "Ole hyvä ja valitse sovelias paikka.";

/* Error message for the user, when the geocoder is telling us to slow down. */
"Please try again in a few moments." = "Yritä uudelleen hetken kuluttua.";

/* failure message when the user should just try again. */
"Please try again later." = "Please try again later.";

/* No comment provided by engineer. */
"Please upload to determine data quality" = "Ole hyvä ja lataa havainnot määrittääksesi datan laadun";

/* portugal partner */
"Portugal: Associação Biodiversidade Para Todos operating Biodiversity4All (Biodiversity4All.org)." = "Portugali: Associação Biodiversidade Para Todos ylläpitää portaalia Biodiversity4All (Biodiversity4All.org).";

/* label for a news post author */
"Posted by" = "Lähettänyt";

/* label for prefer no tracking switch in settings */
"Prefer No Tracking" = "Prefer No Tracking";

/* Emphasized part of the privacy base text. */
"Privacy Policy" = "Tietosuojakäytäntö";

/* private geoprivacy */
"Private" = "Yksityinen";

/* No comment provided by engineer. */
"projects" = "projektit";

/* choose projects button title. */
"Projects" = "Projektit";

/* Title for projects tutorial screen */
"Projects are collections of observations with a common purpose" = "Projektit kokoavat havaintoja, joilla on jotakin yhteistä";

/* No comment provided by engineer. */
"Pull to Refresh" = "Vedä päivittääksesi";

/* Rank in an ordered list */
"Rank" = "Luokka";

/* action to re-download a species guide from the server */
"Re-download" = "Lataa uudelleen";

/* No comment provided by engineer. */
"Remove my profile photo" = "Poista profilikuvani";

/* No comment provided by engineer. */
"Removing..." = "Poistetaan...";

/* No comment provided by engineer. */
"RESEARCH" = "TUTKIMUS";

/* research data quality */
"Research Grade" = "Tutkimusaste";

/* No comment provided by engineer. */
"Restricted to current map area" = "Rajoitettu nykyisen kartan alueelle";

/* Retake a photo */
"RETAKE" = "Uusi kuva";

/* accessibility label for reverse/switch camera button */
"Reverse Camera" = "Käänteinen kamera";

/* Title for save new observation button */
"SAVE" = "TALLENNA";

/* No comment provided by engineer. */
"Save Anyway" = "Tallenna silti";

/* No comment provided by engineer. */
"Saving..." = "Tallennetaan...";

/* No comment provided by engineer. */
"Search" = "Hae";

/* placeholder for guide search field */
"Search for guide named..." = "Etsi opasta nimellä...";

/* placeholder for project search field */
"Search for project named..." = "Etsi projektin nimellä...";

/* No comment provided by engineer. */
"Searching for organisms..." = "Haetaan eliöitä...";

/* No comment provided by engineer. */
"Searching for people..." = "Haetaan ihmisiä...";

/* No comment provided by engineer. */
"Searching for place..." = "Haetaan paikkoja...";

/* No comment provided by engineer. */
"Searching for project..." = "Haetaan projekteja...";

/* No comment provided by engineer. */
"Searching for recent observations in map area" = "Haetaan viimeaikaisia havaintoja kartan alueella";

/* No comment provided by engineer. */
"Searching for recent observations worldwide" = "Haetaan viimeaikaisia havaintoja maailmanlaajuisesti";

/* No comment provided by engineer. */
"seen at '%@'" = "nähty paikassa '%@'";

/* No comment provided by engineer. */
"seen by '%@'" = "nähnyt '%@'";

/* basis for a suggestion */
"Seen Nearby" = "Nähty lähistöllä";

/* default select title */
"Select" = "Valitse";

/* select taxon title */
"Select \"%@\"" = "Valitse \"%@\"";

/* title for date selector */
"Select Date" = "Valitse päivämäärä";

/* title for geoprivacy selector */
"Select Privacy" = "Valitse tietosuoja";

/* No comment provided by engineer. */
"Selected Observation" = "Valittu havainto";

/* accessibility label for choose profile photo button */
"Set Profile Photo" = "Aseta profiilikuva";

/* Notice while we're setting up an iNat account for them */
"Setting up iNaturalist account..." = "Setting up iNaturalist account...";

/* accessibility label for settings button
   Title for the settings screen. */
"Settings" = "Asetukset";

/* Title for share new observation button */
"SHARE" = "JAA";

/* Prompt to sign in on the Me tab header. */
"Share your observations with the community." = "Jaa havaintosi yhteisön kanssa.";

/* label for iNaturalist store (tshirts/etc) action in settings. */
"Shop the iNat Store" = "Vieraile iNat-kaupassa";

/* No comment provided by engineer. */
"Sign out" = "Kirjaudu ulos";

/* Title for button that allows users to sign up for a new iNat account */
"Sign Up" = "Rekisteröidy";

/* emphasis text for the 'switch to signup mode' button. must be a substring of the base text */
"Sign up now!" = "Rekisteröidy nyt!";

/* No comment provided by engineer. */
"Signing Out" = "Kirjaudutaan ulos";

/* skip button title */
"Skip ›" = "Ohita ›";

/* No comment provided by engineer. */
"Somewhere..." = "Jossakin...";

/* Label for the sort selector in the explore leaderboard header. */
"Sort" = "Järjestä";

/* credit for the wikipedia snippet that we include in inat taxon pages. first substitution is the article name, the second substitution is the license name. */
"Source: Wikipedia, %1$@, %2$@" = "Lähde: Wikipedia, %1$@, %2$@";

/* Species option for Explore leaderboard sorting. Must be short. */
"Species" = "Laji";

/* Title for button in the explore tab that leads to the stats leaderboard. */
"Stats" = "Tilastot";

/* accessibility label for stop uploading button */
"Stop Uploading" = "Pysäytä tallennus";

/* No comment provided by engineer. */
"Suggest ID" = "Ehdota tunnistetta";

/* label for suggest species switch in settings */
"Suggest species" = "Ehdota lajia";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community, including %@, %@, %@, and many others." = "Ehdotukset perustuen iNaturalist-yhteisön havaintoihin ja tunnistuksiin, mukaan lukien %1$@, %2$@, %3$@ ja monet muut.";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community." = "Ehdotukset perustuen iNaturalist-yhteisön havaintoihin ja tunnistuksiin.";

/* Title of me header when syncing. */
"Syncing..." = "Synkronoidaan...";

/* Tags (kind of like categories) are applied to the species in a guide, and allow the guide editor to group and organize the species in a guide. */
"TAGS" = "TUNNISTEET";

/* No comment provided by engineer. */
"Take a photo" = "Ota kuva";

/* Title for description/comment when adding an ID */
"Tell Us Why" = "Kerro meille miksi";

/* Emphasized part of the terms of service base text. */
"Terms of Service" = "Käyttöehdot";

/* No comment provided by engineer. */
"There are no observations for this project yet. Check back soon!" = "Tässä projektissa ei ole vielä havaintoja. Tule katsomaan myöhemmin uudelleen!";

/* Unresolvable and unknown error during observation upload. */
"There was an unexpected error." = "Odottamaton virhe.";

/* No comment provided by engineer. */
"This observation has been voted as Casual Grade by the iNaturalist community." = "iNaturalist-yhteisö on äänestänyt että tämä havainto on epämuodollinen.";

/* No comment provided by engineer. */
"This observation is Casual Grade because it has been voted captive or cultivated by the iNaturalist community." = "Tämä havainto on epämuodollinen, koska iNaturalistin yhteisö on äänestänyt että se on vangittu tai viljelty.";

/* No comment provided by engineer. */
"This observation needs a date to be considered for Research Grade." = "Noustakseen tutkimustasolle tässä havainnoissa pitää olla päivämäärä.";

/* No comment provided by engineer. */
"This observation needs a location to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee sijaintitiedon.";

/* No comment provided by engineer. */
"This observation needs a more specific consensus ID to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee tarkempia tunnistuksia iNaturalist-yhteisöltä.";

/* No comment provided by engineer. */
"This observation needs a photo to be considered for Research Grade." = "Noustakseen tutkimustasolle tässä havainnoissa pitää olla valokuva tai äänite.";

/* No comment provided by engineer. */
"This observation needs more IDs from the iNat community to be considered for Research Grade." = "Noustakseen tutkimustasolle tämä havainto tarvitsee lisää tunnistuksia iNaturalist-yhteisöltä.";

/* No comment provided by engineer. */
"This project has no description." = "Tällä projektilla ei ole kuvausta.";

/* No comment provided by engineer. */
"This project has no title." = "Tällä projektilla ei ole otsikkoa.";

/* No comment provided by engineer. */
"This will also remove your observations from this project." = "Tämä myös poistaa havaintosi tästä projektista.";

/* No comment provided by engineer. */
"This will destroy any changes/additions you've made from this app that haven't been synced with iNaturalist.org." = "Tämä poistaa kaikki tässä sovelluksessa tekemäsi muutokset/lisäykset, joita ei ole vielä synkronoitu iNaturalist.org:iin.";

/* No comment provided by engineer. */
"This will download %@ of data so you can use this guide even when you don't have Internet access." = "Tämä lataa %@ tietoja, joten voit käyttää tätä opasta myös jos sinulla ei ole internet-yhteyttä.";

/* Label for the time period selector in the explore leaderboard header. */
"Time Period" = "Ajanjakso";

/* No comment provided by engineer. */
"Timeout" = "Aikakatkaisu";

/* project title header */
"Title" = "Otsikko";

/* Traditional inat type of project, where users have to manually add observations to the project. */
"Traditional Project" = "Perinteinen projekti";

/* No comment provided by engineer. */
"Try again next time you're connected to the Internet." = "Kokeile uudelleen seuraavan kerran kun olet yhteydessä internetiin.";

/* button title to turn on autoupload */
"Turn On" = "Kytke päälle";

/* message of autoupload introduction alert view */
"Turn on Auto Upload and your observations will be automatically uploaded to iNaturalist." = "Ota käyttöön automaattinen lataus niin havaintosi tallennetaan automaattisesti iNaturalistiin.";

/* Umbrella type of project, which contains other projects within it. */
"Umbrella Project" = "Umbrella-projekti";

/* Failure message when making an identification */
"Unable to add an identification to this observation. Please try again later." = "Tunnistusta ei voitu lisätä tähän havaintoon. Ole hyvä ja yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Unable to find location" = "Sijaintiasi ei voida löytää";

/* place guess when we have lat/lng but it's not geocoded */
"Unable to find location name" = "Paikan nimeä ei löydy";

/* Failure message when making an identification */
"Unable to identify this observation to that species. Please try again later." = "Tätä havaintoa ei voitu tunnistaa tuoksi lajiksi. Ole hyvä ja yritä myöhemmin uudelleen.";

/* Title for error */
"Unable to load page" = "Sivua ei voida ladata";

/* This is an explanation for when we get a 401 during upload/sync. */
"Unable to upload to iNaturalist, error 401 unauthenticated. Please contact help@inaturalist.org and try later." = "Havaintoja ei voitu ladata iNaturalistiin (virhe 401 unauthenticated). Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org ja yritä myöhemmin uudelleen.";

/* unknown taxon */
"Unknown" = "Tuntematon";

/* Text shown in place of a post author when a post has no known author */
"Unknown author" = "Tuntematon tekijä";

/* Message body when we don't know the error */
"Unknown error" = "Tuntematon virhe";

/* Unknown error */
"Unknown error while making an identification." = "Tuntematon virhe tunnistusta tehtäessä.";

/* message to the user when we get an unknown error. the %ld will be a status code */
"Unknown Error: %ld" = "Tuntematon virhe: %ld";

/* Title displayed for a journal post when the post has no title */
"Untitled Post" = "Nimetön viesti";

/* Title for progress view when migrating db */
"Updating database..." = "Päivitetään tietokantaa...";

/* No comment provided by engineer. */
"Updating..." = "Päivitetään...";

/* accessibility labelf for upload button
   Title for upload button. */
"Upload" = "Lähetä";

/* No comment provided by engineer. */
"Upload Error" = "Lähetysvirhe";

/* upload failed alert title */
"Upload Failed" = "Lähetys epäonnistui";

/* No comment provided by engineer. */
"Upload this observation to enable comments & identifications." = "Lähetä tämä havainto ottaaksesi kommentit ja tunnistamiset käyttöön.";

/* No comment provided by engineer. */
"Upload this observation to enable faves." = "Lähetä tämä havainto, jotta siitä voisi tehdä suosikin.";

/* subtitle for observation while it's uploading. */
"Uploading..." = "Lähetetään...";

/* label for username field in settings
   The desired username during signup. */
"Username" = "Käyttäjänimi";

/* users can login with their username or their email address. */
"Username or email" = "Käyttäjätunnus tai sähköposti";

/* Title for version section of settings. */
"Version" = "Versio";

/* label for start video tutorial action in settings. */
"Video Tutorial" = "Video-opastus";

/* unknown taxon subtitle when suggestions are available */
"View suggestions" = "Paina tästä niin näet ehdotuksia";

/* Subtitle below image for projects tutorial screen. The string is the URL for iNat (or partner site) */
"Visit %@ to create your own projects" = "Vieraile osoitteessa %@ luodaksesi omia projektejasi";

/* Subtitle below image for guides tutorial screen */
"Visit iNaturalist.org to create your own guides" = "Vieraile iNaturalist.orgissa luodaksesi omia oppaitasi";

/* basis for a species suggestion */
"Visually Similar" = "Visuaalisesti samanlainen";

/* basis for a species suggestion */
"Visually Similar / Seen Nearby" = "Visuaalisesti samanlainen / nähty lähistöllä";

/* Subtitle for observation when waiting to upload. */
"Waiting to upload..." = "Odotetaan lähettämistä...";

/* inat ios translators with more than 200 strings contributed, alphabetically */
"We are grateful for the translation assistance provided by the crowdin.com community, especially: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, T.O, testamorta, and vilseskog. To join the iNaturalist iOS translation team, please visit https://crowdin.com/project/inaturalistios." = "Olemme kiitollisia käännösavusta Crowdin.com-yhteisölle. Ryhtyäksesi kääntäjäksi mene osoitteeseen https://crowdin.com/project/inaturalistios";

/* No comment provided by engineer. */
"We don't have permission from iOS to use your location." = "Meillä ei ole iOS: lta lupaa käyttää sijaintiasi.";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation, but here are our top 10 suggestions." = "Emme ole riittävän varmoja antaaksemme suositusta, mutta tässä on kymmenen parasta ehdotusta.";

/* comment for common ancestor suggestion. %1$@ is the rank name (order, family), whereas %2$@ is the actual rank (Animalia, Insecta) */
"We're pretty sure this is in the %1$@ %2$@." = "Olemme melko varmoja että tämä on %1$@ %2$@.";

/* unknown taxon title */
"What did you see?" = "Mitä näet?";

/* title for alert explaining what captive means */
"What does captive / cultivated mean?" = "Mitä vangittu / viljelty tarkoittaa?";

/* No comment provided by engineer. */
"Which organism?" = "Mikä organismi?";

/* No comment provided by engineer. */
"Which person?" = "Mikä henkilö?";

/* No comment provided by engineer. */
"Which place?" = "Mikä paikka?";

/* No comment provided by engineer. */
"Which project?" = "Mikä projekti?";

/* No comment provided by engineer. */
"Whoops" = "Hupsis";

/* Default upload failure alert title. */
"Whoops!" = "Hupsis!";

/* No comment provided by engineer. */
"Without a date, this observation may be very hard for others to identify accurately, and will never attain research grade." = "Jos havainnolla ei ole päivämäärää, muiden on vaikea tunnistaa sitä eikä se voi saavuttaa tutkimustasoa.";

/* No comment provided by engineer. */
"Without a location, this observation will be very hard for others to identify and will never attain research grade." = "Jos havainnolla ei ole paikkaa, muiden on vaikea tunnistaa sitä eikä se voi saavuttaa tutkimustasoa.";

/* No comment provided by engineer. */
"Without at least one photo, this observation will be impossible for others to help identify." = "Muut eivät voi auttaa määrittämään havaintoa, mikäli sillä ei ole yhtään kuvaa tai äänitettä.";

/* message for alert when db migration has a problem */
"Would you like to share your migration report with help@inaturalist.org for debugging?" = "Haluaisitko jakaa siirtoraportin osoitteeseen help@inaturalist.org vianetsintää varten?";

/* positive response to binary choice, yes or no */
"Yes" = "Kyllä";

/* change network partner button */
"Yes, change my affiliation" = "Kyllä, vaihda";

/* No comment provided by engineer. */
"Yes, delete this observation" = "Kyllä, poista tämä havainto";

/* Base text for the license my content checkbox during account creation */
"Yes, license my content so scientists can use my data. Learn More" = "Kyllä, lisensoi lisäämäni sisältö niin että tutkijat voivat käyttää sitä. Lue lisää";

/* failure message when the user tries to change their network affiliation too often */
"You can only change your network affiliation once per day." = "Voit vaihtaa tunnuksesi liitoksen vain kerran päivässä.";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org" = "Sinulla ei ole oikeuksia tehdä tätä. Tilisi voi olla jäädytetty. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org." = "Sinulla ei ole oikeuksia tehdä tätä. Tilisi voi olla jäädytetty. Ole hyvä ja ota yhteyttä osoitteeseen help@inaturalist.org.";

/* No comment provided by engineer. */
"You must be connected to the Internet to do this." = "Sinun on oltava yhteydessä internetiin tehdäksesi tämän.";

/* No comment provided by engineer. */
"You must be connected to the Internet to upload to iNaturalist.org" = "Sinun on oltava yhteydessä internetiin ladataksesi havaintoja iNaturalistiin";

/* No comment provided by engineer. */
"You must be logged in to access projects." = "Sinun täytyy olla kirjautunut sisään päästäksesi projekteihin.";

/* Unspecific signup prompt reason. */
"You must be logged in to do that." = "Sinun täytyy olla kirjautunut sisään tehdäksesi tämän.";

/* Signup prompt reason when user tries to sync user projects. */
"You must be logged in to sync user projects." = "Sinun täytyy olla kirjautunut sisään sykronoidaksesi projektit.";

/* This is an explanation for why the upload button triggers a login prompt. */
"You must be logged in to upload." = "Sinun pitää kirjautua sisään lisätäksesi havaintoja.";

/* No comment provided by engineer. */
"You must be logged in!" = "Sinun täytyy olla kirjautunut sisään!";

/* Account is required error message */
"You must be logged in." = "Sinun täytyy olla kirjautunut sisään.";

/* Reason text for signup prompt while trying to join a project. */
"You must be signed in to join a project." = "Sinun täytyy olla kirjautunut sisään liittyäksesi projektiin.";

/* 401 unauthorized message */
"You need to login to do that." = "Sinun täytyy kirjautua tehdäksesi sen.";

/* No comment provided by engineer. */
"You will receive updates once you've uploaded observations." = "Saat päivityksiä, kun olet lähettänyt havaintoja.";

/* Title for account section of settings. */
"Your Account" = "Tilisi";

/* No comment provided by engineer. */
"Your Guides" = "Oppaasi";

/* Placeholder for free text observation field value */
"Your response here" = "Vastauksesi tähän";
